# ElemIsReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElemIsReference Property
ParameterTypeId Class See Also
---
"Reference"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElemIsReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElemIsReference As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElemIsReference {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace